zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_EDMA_TCD.h
/*! @name TCD0_BITER_ELINKYES - TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define LPE_EDMA_TCD_TCD0_BITER_ELINKYES_BITER_MASK (0x1FFU)
#define LPE_EDMA_TCD_TCD0_BITER_ELINKYES_BITER_SHIFT (0U)
#define LPE_EDMA_TCD_TCD0_BITER_ELINKYES_BITER_WIDTH (9U)
#define LPE_EDMA_TCD_TCD0_BITER_ELINKYES_BITER(x) (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD0_BITER_ELINKYES_BITER_SHIFT)) & LPE_EDMA_TCD_TCD0_BITER_ELINKYES_BITER_MASK)

#define LPE_EDMA_TCD_TCD0_BITER_ELINKYES_LINKCH_MASK (0x1E00U)
#define LPE_EDMA_TCD_TCD0_BITER_ELINKYES_LINKCH_SHIFT (9U)
#define LPE_EDMA_TCD_TCD0_BITER_ELINKYES_LINKCH_WIDTH (4U)
#define LPE_EDMA_TCD_TCD0_BITER_ELINKYES_LINKCH(x) (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD0_BITER_ELINKYES_LINKCH_SHIFT)) & LPE_EDMA_TCD_TCD0_BITER_ELINKYES_LINKCH_MASK)

#define LPE_EDMA_TCD_TCD0_BITER_ELINKYES_ELINK_MASK (0x8000U)
#define LPE_EDMA_TCD_TCD0_BITER_ELINKYES_ELINK_SHIFT (15U)
#define LPE_EDMA_TCD_TCD0_BITER_ELINKYES_ELINK_WIDTH (1U)
#define LPE_EDMA_TCD_TCD0_BITER_ELINKYES_ELINK(x) (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD0_BITER_ELINKYES_ELINK_SHIFT)) & LPE_EDMA_TCD_TCD0_BITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name CH1_CSR - Channel Control and Status */
/*! @{ */

#define LPE_EDMA_TCD_CH1_CSR_ERQ_MASK            (0x1U)
#define LPE_EDMA_TCD_CH1_CSR_ERQ_SHIFT           (0U)
#define LPE_EDMA_TCD_CH1_CSR_ERQ_WIDTH           (1U)
#define LPE_EDMA_TCD_CH1_CSR_ERQ(x)              (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH1_CSR_ERQ_SHIFT)) & LPE_EDMA_TCD_CH1_CSR_ERQ_MASK)

#define LPE_EDMA_TCD_CH1_CSR_EARQ_MASK           (0x2U)
#define LPE_EDMA_TCD_CH1_CSR_EARQ_SHIFT          (1U)
#define LPE_EDMA_TCD_CH1_CSR_EARQ_WIDTH          (1U)
#define LPE_EDMA_TCD_CH1_CSR_EARQ(x)             (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH1_CSR_EARQ_SHIFT)) & LPE_EDMA_TCD_CH1_CSR_EARQ_MASK)

#define LPE_EDMA_TCD_CH1_CSR_EEI_MASK            (0x4U)
#define LPE_EDMA_TCD_CH1_CSR_EEI_SHIFT           (2U)
#define LPE_EDMA_TCD_CH1_CSR_EEI_WIDTH           (1U)
#define LPE_EDMA_TCD_CH1_CSR_EEI(x)              (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH1_CSR_EEI_SHIFT)) & LPE_EDMA_TCD_CH1_CSR_EEI_MASK)

#define LPE_EDMA_TCD_CH1_CSR_EBW_MASK            (0x8U)
#define LPE_EDMA_TCD_CH1_CSR_EBW_SHIFT           (3U)
#define LPE_EDMA_TCD_CH1_CSR_EBW_WIDTH           (1U)
#define LPE_EDMA_TCD_CH1_CSR_EBW(x)              (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH1_CSR_EBW_SHIFT)) & LPE_EDMA_TCD_CH1_CSR_EBW_MASK)

#define LPE_EDMA_TCD_CH1_CSR_DONE_MASK           (0x40000000U)
#define LPE_EDMA_TCD_CH1_CSR_DONE_SHIFT          (30U)
#define LPE_EDMA_TCD_CH1_CSR_DONE_WIDTH          (1U)
#define LPE_EDMA_TCD_CH1_CSR_DONE(x)             (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH1_CSR_DONE_SHIFT)) & LPE_EDMA_TCD_CH1_CSR_DONE_MASK)

#define LPE_EDMA_TCD_CH1_CSR_ACTIVE_MASK         (0x80000000U)
#define LPE_EDMA_TCD_CH1_CSR_ACTIVE_SHIFT        (31U)
#define LPE_EDMA_TCD_CH1_CSR_ACTIVE_WIDTH        (1U)
#define LPE_EDMA_TCD_CH1_CSR_ACTIVE(x)           (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH1_CSR_ACTIVE_SHIFT)) & LPE_EDMA_TCD_CH1_CSR_ACTIVE_MASK)
/*! @} */

/*! @name CH1_ES - Channel Error Status */
/*! @{ */

#define LPE_EDMA_TCD_CH1_ES_DBE_MASK             (0x1U)
#define LPE_EDMA_TCD_CH1_ES_DBE_SHIFT            (0U)
#define LPE_EDMA_TCD_CH1_ES_DBE_WIDTH            (1U)
#define LPE_EDMA_TCD_CH1_ES_DBE(x)               (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH1_ES_DBE_SHIFT)) & LPE_EDMA_TCD_CH1_ES_DBE_MASK)

#define LPE_EDMA_TCD_CH1_ES_SBE_MASK             (0x2U)
#define LPE_EDMA_TCD_CH1_ES_SBE_SHIFT            (1U)
#define LPE_EDMA_TCD_CH1_ES_SBE_WIDTH            (1U)
#define LPE_EDMA_TCD_CH1_ES_SBE(x)               (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH1_ES_SBE_SHIFT)) & LPE_EDMA_TCD_CH1_ES_SBE_MASK)

#define LPE_EDMA_TCD_CH1_ES_SGE_MASK             (0x4U)
#define LPE_EDMA_TCD_CH1_ES_SGE_SHIFT            (2U)
#define LPE_EDMA_TCD_CH1_ES_SGE_WIDTH            (1U)
#define LPE_EDMA_TCD_CH1_ES_SGE(x)               (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH1_ES_SGE_SHIFT)) & LPE_EDMA_TCD_CH1_ES_SGE_MASK)

#define LPE_EDMA_TCD_CH1_ES_NCE_MASK             (0x8U)
#define LPE_EDMA_TCD_CH1_ES_NCE_SHIFT            (3U)
#define LPE_EDMA_TCD_CH1_ES_NCE_WIDTH            (1U)
#define LPE_EDMA_TCD_CH1_ES_NCE(x)               (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH1_ES_NCE_SHIFT)) & LPE_EDMA_TCD_CH1_ES_NCE_MASK)

#define LPE_EDMA_TCD_CH1_ES_DOE_MASK             (0x10U)
#define LPE_EDMA_TCD_CH1_ES_DOE_SHIFT            (4U)
#define LPE_EDMA_TCD_CH1_ES_DOE_WIDTH            (1U)
#define LPE_EDMA_TCD_CH1_ES_DOE(x)               (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH1_ES_DOE_SHIFT)) & LPE_EDMA_TCD_CH1_ES_DOE_MASK)

#define LPE_EDMA_TCD_CH1_ES_DAE_MASK             (0x20U)
#define LPE_EDMA_TCD_CH1_ES_DAE_SHIFT            (5U)
#define LPE_EDMA_TCD_CH1_ES_DAE_WIDTH            (1U)
#define LPE_EDMA_TCD_CH1_ES_DAE(x)               (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH1_ES_DAE_SHIFT)) & LPE_EDMA_TCD_CH1_ES_DAE_MASK)

#define LPE_EDMA_TCD_CH1_ES_SOE_MASK             (0x40U)
#define LPE_EDMA_TCD_CH1_ES_SOE_SHIFT            (6U)
#define LPE_EDMA_TCD_CH1_ES_SOE_WIDTH            (1U)
#define LPE_EDMA_TCD_CH1_ES_SOE(x)               (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH1_ES_SOE_SHIFT)) & LPE_EDMA_TCD_CH1_ES_SOE_MASK)

#define LPE_EDMA_TCD_CH1_ES_SAE_MASK             (0x80U)
#define LPE_EDMA_TCD_CH1_ES_SAE_SHIFT            (7U)
#define LPE_EDMA_TCD_CH1_ES_SAE_WIDTH            (1U)
#define LPE_EDMA_TCD_CH1_ES_SAE(x)               (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH1_ES_SAE_SHIFT)) & LPE_EDMA_TCD_CH1_ES_SAE_MASK)

#define LPE_EDMA_TCD_CH1_ES_ERR_MASK             (0x80000000U)
#define LPE_EDMA_TCD_CH1_ES_ERR_SHIFT            (31U)
#define LPE_EDMA_TCD_CH1_ES_ERR_WIDTH            (1U)
#define LPE_EDMA_TCD_CH1_ES_ERR(x)               (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH1_ES_ERR_SHIFT)) & LPE_EDMA_TCD_CH1_ES_ERR_MASK)
/*! @} */

/*! @name CH1_INT - Channel Interrupt Status */
/*! @{ */

#define LPE_EDMA_TCD_CH1_INT_INT_MASK            (0x1U)
#define LPE_EDMA_TCD_CH1_INT_INT_SHIFT           (0U)
#define LPE_EDMA_TCD_CH1_INT_INT_WIDTH           (1U)
#define LPE_EDMA_TCD_CH1_INT_INT(x)              (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH1_INT_INT_SHIFT)) & LPE_EDMA_TCD_CH1_INT_INT_MASK)
/*! @} */

/*! @name CH1_SBR - Channel System Bus */
/*! @{ */

#define LPE_EDMA_TCD_CH1_SBR_MID_MASK            (0x3FU)
#define LPE_EDMA_TCD_CH1_SBR_MID_SHIFT           (0U)
#define LPE_EDMA_TCD_CH1_SBR_MID_WIDTH           (6U)
#define LPE_EDMA_TCD_CH1_SBR_MID(x)              (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH1_SBR_MID_SHIFT)) & LPE_EDMA_TCD_CH1_SBR_MID_MASK)

#define LPE_EDMA_TCD_CH1_SBR_PAL_MASK            (0x8000U)
#define LPE_EDMA_TCD_CH1_SBR_PAL_SHIFT           (15U)
#define LPE_EDMA_TCD_CH1_SBR_PAL_WIDTH           (1U)
#define LPE_EDMA_TCD_CH1_SBR_PAL(x)              (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH1_SBR_PAL_SHIFT)) & LPE_EDMA_TCD_CH1_SBR_PAL_MASK)

#define LPE_EDMA_TCD_CH1_SBR_EMI_MASK            (0x10000U)
#define LPE_EDMA_TCD_CH1_SBR_EMI_SHIFT           (16U)
#define LPE_EDMA_TCD_CH1_SBR_EMI_WIDTH           (1U)
#define LPE_EDMA_TCD_CH1_SBR_EMI(x)              (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH1_SBR_EMI_SHIFT)) & LPE_EDMA_TCD_CH1_SBR_EMI_MASK)

#define LPE_EDMA_TCD_CH1_SBR_ATTR_MASK           (0x20000U)
#define LPE_EDMA_TCD_CH1_SBR_ATTR_SHIFT          (17U)
#define LPE_EDMA_TCD_CH1_SBR_ATTR_WIDTH          (1U)
#define LPE_EDMA_TCD_CH1_SBR_ATTR(x)             (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH1_SBR_ATTR_SHIFT)) & LPE_EDMA_TCD_CH1_SBR_ATTR_MASK)
/*! @} */

