zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_EDMA_TCD.h
/*! @name TCD1_DADDR - TCD Destination Address */
/*! @{ */

#define LPE_EDMA_TCD_TCD1_DADDR_DADDR_MASK       (0xFFFFFFFFU)
#define LPE_EDMA_TCD_TCD1_DADDR_DADDR_SHIFT      (0U)
#define LPE_EDMA_TCD_TCD1_DADDR_DADDR_WIDTH      (32U)
#define LPE_EDMA_TCD_TCD1_DADDR_DADDR(x)         (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD1_DADDR_DADDR_SHIFT)) & LPE_EDMA_TCD_TCD1_DADDR_DADDR_MASK)
/*! @} */

/*! @name TCD1_DOFF - TCD Signed Destination Address Offset */
/*! @{ */

#define LPE_EDMA_TCD_TCD1_DOFF_DOFF_MASK         (0xFFFFU)
#define LPE_EDMA_TCD_TCD1_DOFF_DOFF_SHIFT        (0U)
#define LPE_EDMA_TCD_TCD1_DOFF_DOFF_WIDTH        (16U)
#define LPE_EDMA_TCD_TCD1_DOFF_DOFF(x)           (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD1_DOFF_DOFF_SHIFT)) & LPE_EDMA_TCD_TCD1_DOFF_DOFF_MASK)
/*! @} */

/*! @name TCD1_CITER_ELINKNO - TCD Current Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define LPE_EDMA_TCD_TCD1_CITER_ELINKNO_CITER_MASK (0x7FFFU)
#define LPE_EDMA_TCD_TCD1_CITER_ELINKNO_CITER_SHIFT (0U)
#define LPE_EDMA_TCD_TCD1_CITER_ELINKNO_CITER_WIDTH (15U)
#define LPE_EDMA_TCD_TCD1_CITER_ELINKNO_CITER(x) (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD1_CITER_ELINKNO_CITER_SHIFT)) & LPE_EDMA_TCD_TCD1_CITER_ELINKNO_CITER_MASK)

#define LPE_EDMA_TCD_TCD1_CITER_ELINKNO_ELINK_MASK (0x8000U)
#define LPE_EDMA_TCD_TCD1_CITER_ELINKNO_ELINK_SHIFT (15U)
#define LPE_EDMA_TCD_TCD1_CITER_ELINKNO_ELINK_WIDTH (1U)
#define LPE_EDMA_TCD_TCD1_CITER_ELINKNO_ELINK(x) (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD1_CITER_ELINKNO_ELINK_SHIFT)) & LPE_EDMA_TCD_TCD1_CITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD1_CITER_ELINKYES - TCD Current Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define LPE_EDMA_TCD_TCD1_CITER_ELINKYES_CITER_MASK (0x1FFU)
#define LPE_EDMA_TCD_TCD1_CITER_ELINKYES_CITER_SHIFT (0U)
#define LPE_EDMA_TCD_TCD1_CITER_ELINKYES_CITER_WIDTH (9U)
#define LPE_EDMA_TCD_TCD1_CITER_ELINKYES_CITER(x) (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD1_CITER_ELINKYES_CITER_SHIFT)) & LPE_EDMA_TCD_TCD1_CITER_ELINKYES_CITER_MASK)

#define LPE_EDMA_TCD_TCD1_CITER_ELINKYES_LINKCH_MASK (0x1E00U)
#define LPE_EDMA_TCD_TCD1_CITER_ELINKYES_LINKCH_SHIFT (9U)
#define LPE_EDMA_TCD_TCD1_CITER_ELINKYES_LINKCH_WIDTH (4U)
#define LPE_EDMA_TCD_TCD1_CITER_ELINKYES_LINKCH(x) (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD1_CITER_ELINKYES_LINKCH_SHIFT)) & LPE_EDMA_TCD_TCD1_CITER_ELINKYES_LINKCH_MASK)

#define LPE_EDMA_TCD_TCD1_CITER_ELINKYES_ELINK_MASK (0x8000U)
#define LPE_EDMA_TCD_TCD1_CITER_ELINKYES_ELINK_SHIFT (15U)
#define LPE_EDMA_TCD_TCD1_CITER_ELINKYES_ELINK_WIDTH (1U)
#define LPE_EDMA_TCD_TCD1_CITER_ELINKYES_ELINK(x) (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD1_CITER_ELINKYES_ELINK_SHIFT)) & LPE_EDMA_TCD_TCD1_CITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name TCD1_DLAST_SGA - TCD Last Destination Address Adjustment / Scatter Gather Address */
/*! @{ */

#define LPE_EDMA_TCD_TCD1_DLAST_SGA_DLAST_SGA_MASK (0xFFFFFFFFU)
#define LPE_EDMA_TCD_TCD1_DLAST_SGA_DLAST_SGA_SHIFT (0U)
#define LPE_EDMA_TCD_TCD1_DLAST_SGA_DLAST_SGA_WIDTH (32U)
#define LPE_EDMA_TCD_TCD1_DLAST_SGA_DLAST_SGA(x) (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD1_DLAST_SGA_DLAST_SGA_SHIFT)) & LPE_EDMA_TCD_TCD1_DLAST_SGA_DLAST_SGA_MASK)
/*! @} */

/*! @name TCD1_CSR - TCD Control and Status */
/*! @{ */

#define LPE_EDMA_TCD_TCD1_CSR_START_MASK         (0x1U)
#define LPE_EDMA_TCD_TCD1_CSR_START_SHIFT        (0U)
#define LPE_EDMA_TCD_TCD1_CSR_START_WIDTH        (1U)
#define LPE_EDMA_TCD_TCD1_CSR_START(x)           (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD1_CSR_START_SHIFT)) & LPE_EDMA_TCD_TCD1_CSR_START_MASK)

#define LPE_EDMA_TCD_TCD1_CSR_INTMAJOR_MASK      (0x2U)
#define LPE_EDMA_TCD_TCD1_CSR_INTMAJOR_SHIFT     (1U)
#define LPE_EDMA_TCD_TCD1_CSR_INTMAJOR_WIDTH     (1U)
#define LPE_EDMA_TCD_TCD1_CSR_INTMAJOR(x)        (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD1_CSR_INTMAJOR_SHIFT)) & LPE_EDMA_TCD_TCD1_CSR_INTMAJOR_MASK)

#define LPE_EDMA_TCD_TCD1_CSR_INTHALF_MASK       (0x4U)
#define LPE_EDMA_TCD_TCD1_CSR_INTHALF_SHIFT      (2U)
#define LPE_EDMA_TCD_TCD1_CSR_INTHALF_WIDTH      (1U)
#define LPE_EDMA_TCD_TCD1_CSR_INTHALF(x)         (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD1_CSR_INTHALF_SHIFT)) & LPE_EDMA_TCD_TCD1_CSR_INTHALF_MASK)

#define LPE_EDMA_TCD_TCD1_CSR_DREQ_MASK          (0x8U)
#define LPE_EDMA_TCD_TCD1_CSR_DREQ_SHIFT         (3U)
#define LPE_EDMA_TCD_TCD1_CSR_DREQ_WIDTH         (1U)
#define LPE_EDMA_TCD_TCD1_CSR_DREQ(x)            (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD1_CSR_DREQ_SHIFT)) & LPE_EDMA_TCD_TCD1_CSR_DREQ_MASK)

#define LPE_EDMA_TCD_TCD1_CSR_ESG_MASK           (0x10U)
#define LPE_EDMA_TCD_TCD1_CSR_ESG_SHIFT          (4U)
#define LPE_EDMA_TCD_TCD1_CSR_ESG_WIDTH          (1U)
#define LPE_EDMA_TCD_TCD1_CSR_ESG(x)             (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD1_CSR_ESG_SHIFT)) & LPE_EDMA_TCD_TCD1_CSR_ESG_MASK)

#define LPE_EDMA_TCD_TCD1_CSR_MAJORELINK_MASK    (0x20U)
#define LPE_EDMA_TCD_TCD1_CSR_MAJORELINK_SHIFT   (5U)
#define LPE_EDMA_TCD_TCD1_CSR_MAJORELINK_WIDTH   (1U)
#define LPE_EDMA_TCD_TCD1_CSR_MAJORELINK(x)      (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD1_CSR_MAJORELINK_SHIFT)) & LPE_EDMA_TCD_TCD1_CSR_MAJORELINK_MASK)

#define LPE_EDMA_TCD_TCD1_CSR_ESDA_MASK          (0x80U)
#define LPE_EDMA_TCD_TCD1_CSR_ESDA_SHIFT         (7U)
#define LPE_EDMA_TCD_TCD1_CSR_ESDA_WIDTH         (1U)
#define LPE_EDMA_TCD_TCD1_CSR_ESDA(x)            (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD1_CSR_ESDA_SHIFT)) & LPE_EDMA_TCD_TCD1_CSR_ESDA_MASK)

#define LPE_EDMA_TCD_TCD1_CSR_MAJORLINKCH_MASK   (0xF00U)
#define LPE_EDMA_TCD_TCD1_CSR_MAJORLINKCH_SHIFT  (8U)
#define LPE_EDMA_TCD_TCD1_CSR_MAJORLINKCH_WIDTH  (4U)
#define LPE_EDMA_TCD_TCD1_CSR_MAJORLINKCH(x)     (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD1_CSR_MAJORLINKCH_SHIFT)) & LPE_EDMA_TCD_TCD1_CSR_MAJORLINKCH_MASK)

#define LPE_EDMA_TCD_TCD1_CSR_BWC_MASK           (0xC000U)
#define LPE_EDMA_TCD_TCD1_CSR_BWC_SHIFT          (14U)
#define LPE_EDMA_TCD_TCD1_CSR_BWC_WIDTH          (2U)
#define LPE_EDMA_TCD_TCD1_CSR_BWC(x)             (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD1_CSR_BWC_SHIFT)) & LPE_EDMA_TCD_TCD1_CSR_BWC_MASK)
/*! @} */

