zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_EDMA_TCD.h
#define LPE_EDMA_TCD_TCD2_NBYTES_MLOFFNO_SMLOE_MASK (0x80000000U)
#define LPE_EDMA_TCD_TCD2_NBYTES_MLOFFNO_SMLOE_SHIFT (31U)
#define LPE_EDMA_TCD_TCD2_NBYTES_MLOFFNO_SMLOE_WIDTH (1U)
#define LPE_EDMA_TCD_TCD2_NBYTES_MLOFFNO_SMLOE(x) (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD2_NBYTES_MLOFFNO_SMLOE_SHIFT)) & LPE_EDMA_TCD_TCD2_NBYTES_MLOFFNO_SMLOE_MASK)
/*! @} */

/*! @name TCD2_NBYTES_MLOFFYES - TCD Transfer Size with Minor Loop Offsets */
/*! @{ */

#define LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_NBYTES_MASK (0x3FFU)
#define LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_NBYTES_SHIFT (0U)
#define LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_NBYTES_WIDTH (10U)
#define LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_NBYTES(x) (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_NBYTES_SHIFT)) & LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_NBYTES_MASK)

#define LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_MLOFF_MASK (0x3FFFFC00U)
#define LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_MLOFF_SHIFT (10U)
#define LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_MLOFF_WIDTH (20U)
#define LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_MLOFF(x) (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_MLOFF_SHIFT)) & LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_MLOFF_MASK)

#define LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_DMLOE_MASK (0x40000000U)
#define LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_DMLOE_SHIFT (30U)
#define LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_DMLOE_WIDTH (1U)
#define LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_DMLOE(x) (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_DMLOE_SHIFT)) & LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_DMLOE_MASK)

#define LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_SMLOE_MASK (0x80000000U)
#define LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_SMLOE_SHIFT (31U)
#define LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_SMLOE_WIDTH (1U)
#define LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_SMLOE(x) (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_SMLOE_SHIFT)) & LPE_EDMA_TCD_TCD2_NBYTES_MLOFFYES_SMLOE_MASK)
/*! @} */

/*! @name TCD2_SLAST_SDA - TCD Last Source Address Adjustment / Store DADDR Address */
/*! @{ */

#define LPE_EDMA_TCD_TCD2_SLAST_SDA_SLAST_SDA_MASK (0xFFFFFFFFU)
#define LPE_EDMA_TCD_TCD2_SLAST_SDA_SLAST_SDA_SHIFT (0U)
#define LPE_EDMA_TCD_TCD2_SLAST_SDA_SLAST_SDA_WIDTH (32U)
#define LPE_EDMA_TCD_TCD2_SLAST_SDA_SLAST_SDA(x) (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD2_SLAST_SDA_SLAST_SDA_SHIFT)) & LPE_EDMA_TCD_TCD2_SLAST_SDA_SLAST_SDA_MASK)
/*! @} */

/*! @name TCD2_DADDR - TCD Destination Address */
/*! @{ */

#define LPE_EDMA_TCD_TCD2_DADDR_DADDR_MASK       (0xFFFFFFFFU)
#define LPE_EDMA_TCD_TCD2_DADDR_DADDR_SHIFT      (0U)
#define LPE_EDMA_TCD_TCD2_DADDR_DADDR_WIDTH      (32U)
#define LPE_EDMA_TCD_TCD2_DADDR_DADDR(x)         (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD2_DADDR_DADDR_SHIFT)) & LPE_EDMA_TCD_TCD2_DADDR_DADDR_MASK)
/*! @} */

/*! @name TCD2_DOFF - TCD Signed Destination Address Offset */
/*! @{ */

#define LPE_EDMA_TCD_TCD2_DOFF_DOFF_MASK         (0xFFFFU)
#define LPE_EDMA_TCD_TCD2_DOFF_DOFF_SHIFT        (0U)
#define LPE_EDMA_TCD_TCD2_DOFF_DOFF_WIDTH        (16U)
#define LPE_EDMA_TCD_TCD2_DOFF_DOFF(x)           (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD2_DOFF_DOFF_SHIFT)) & LPE_EDMA_TCD_TCD2_DOFF_DOFF_MASK)
/*! @} */

/*! @name TCD2_CITER_ELINKNO - TCD Current Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define LPE_EDMA_TCD_TCD2_CITER_ELINKNO_CITER_MASK (0x7FFFU)
#define LPE_EDMA_TCD_TCD2_CITER_ELINKNO_CITER_SHIFT (0U)
#define LPE_EDMA_TCD_TCD2_CITER_ELINKNO_CITER_WIDTH (15U)
#define LPE_EDMA_TCD_TCD2_CITER_ELINKNO_CITER(x) (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD2_CITER_ELINKNO_CITER_SHIFT)) & LPE_EDMA_TCD_TCD2_CITER_ELINKNO_CITER_MASK)

#define LPE_EDMA_TCD_TCD2_CITER_ELINKNO_ELINK_MASK (0x8000U)
#define LPE_EDMA_TCD_TCD2_CITER_ELINKNO_ELINK_SHIFT (15U)
#define LPE_EDMA_TCD_TCD2_CITER_ELINKNO_ELINK_WIDTH (1U)
#define LPE_EDMA_TCD_TCD2_CITER_ELINKNO_ELINK(x) (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD2_CITER_ELINKNO_ELINK_SHIFT)) & LPE_EDMA_TCD_TCD2_CITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD2_CITER_ELINKYES - TCD Current Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define LPE_EDMA_TCD_TCD2_CITER_ELINKYES_CITER_MASK (0x1FFU)
#define LPE_EDMA_TCD_TCD2_CITER_ELINKYES_CITER_SHIFT (0U)
#define LPE_EDMA_TCD_TCD2_CITER_ELINKYES_CITER_WIDTH (9U)
#define LPE_EDMA_TCD_TCD2_CITER_ELINKYES_CITER(x) (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD2_CITER_ELINKYES_CITER_SHIFT)) & LPE_EDMA_TCD_TCD2_CITER_ELINKYES_CITER_MASK)

#define LPE_EDMA_TCD_TCD2_CITER_ELINKYES_LINKCH_MASK (0x1E00U)
#define LPE_EDMA_TCD_TCD2_CITER_ELINKYES_LINKCH_SHIFT (9U)
#define LPE_EDMA_TCD_TCD2_CITER_ELINKYES_LINKCH_WIDTH (4U)
#define LPE_EDMA_TCD_TCD2_CITER_ELINKYES_LINKCH(x) (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD2_CITER_ELINKYES_LINKCH_SHIFT)) & LPE_EDMA_TCD_TCD2_CITER_ELINKYES_LINKCH_MASK)

#define LPE_EDMA_TCD_TCD2_CITER_ELINKYES_ELINK_MASK (0x8000U)
#define LPE_EDMA_TCD_TCD2_CITER_ELINKYES_ELINK_SHIFT (15U)
#define LPE_EDMA_TCD_TCD2_CITER_ELINKYES_ELINK_WIDTH (1U)
#define LPE_EDMA_TCD_TCD2_CITER_ELINKYES_ELINK(x) (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD2_CITER_ELINKYES_ELINK_SHIFT)) & LPE_EDMA_TCD_TCD2_CITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name TCD2_DLAST_SGA - TCD Last Destination Address Adjustment / Scatter Gather Address */
/*! @{ */

#define LPE_EDMA_TCD_TCD2_DLAST_SGA_DLAST_SGA_MASK (0xFFFFFFFFU)
#define LPE_EDMA_TCD_TCD2_DLAST_SGA_DLAST_SGA_SHIFT (0U)
#define LPE_EDMA_TCD_TCD2_DLAST_SGA_DLAST_SGA_WIDTH (32U)
#define LPE_EDMA_TCD_TCD2_DLAST_SGA_DLAST_SGA(x) (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD2_DLAST_SGA_DLAST_SGA_SHIFT)) & LPE_EDMA_TCD_TCD2_DLAST_SGA_DLAST_SGA_MASK)
/*! @} */

/*! @name TCD2_CSR - TCD Control and Status */
/*! @{ */

#define LPE_EDMA_TCD_TCD2_CSR_START_MASK         (0x1U)
#define LPE_EDMA_TCD_TCD2_CSR_START_SHIFT        (0U)
#define LPE_EDMA_TCD_TCD2_CSR_START_WIDTH        (1U)
#define LPE_EDMA_TCD_TCD2_CSR_START(x)           (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD2_CSR_START_SHIFT)) & LPE_EDMA_TCD_TCD2_CSR_START_MASK)

