zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_EDMA_TCD.h
#define LPE_EDMA_TCD_TCD2_CSR_INTMAJOR_MASK      (0x2U)
#define LPE_EDMA_TCD_TCD2_CSR_INTMAJOR_SHIFT     (1U)
#define LPE_EDMA_TCD_TCD2_CSR_INTMAJOR_WIDTH     (1U)
#define LPE_EDMA_TCD_TCD2_CSR_INTMAJOR(x)        (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD2_CSR_INTMAJOR_SHIFT)) & LPE_EDMA_TCD_TCD2_CSR_INTMAJOR_MASK)

#define LPE_EDMA_TCD_TCD2_CSR_INTHALF_MASK       (0x4U)
#define LPE_EDMA_TCD_TCD2_CSR_INTHALF_SHIFT      (2U)
#define LPE_EDMA_TCD_TCD2_CSR_INTHALF_WIDTH      (1U)
#define LPE_EDMA_TCD_TCD2_CSR_INTHALF(x)         (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD2_CSR_INTHALF_SHIFT)) & LPE_EDMA_TCD_TCD2_CSR_INTHALF_MASK)

#define LPE_EDMA_TCD_TCD2_CSR_DREQ_MASK          (0x8U)
#define LPE_EDMA_TCD_TCD2_CSR_DREQ_SHIFT         (3U)
#define LPE_EDMA_TCD_TCD2_CSR_DREQ_WIDTH         (1U)
#define LPE_EDMA_TCD_TCD2_CSR_DREQ(x)            (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD2_CSR_DREQ_SHIFT)) & LPE_EDMA_TCD_TCD2_CSR_DREQ_MASK)

#define LPE_EDMA_TCD_TCD2_CSR_ESG_MASK           (0x10U)
#define LPE_EDMA_TCD_TCD2_CSR_ESG_SHIFT          (4U)
#define LPE_EDMA_TCD_TCD2_CSR_ESG_WIDTH          (1U)
#define LPE_EDMA_TCD_TCD2_CSR_ESG(x)             (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD2_CSR_ESG_SHIFT)) & LPE_EDMA_TCD_TCD2_CSR_ESG_MASK)

#define LPE_EDMA_TCD_TCD2_CSR_MAJORELINK_MASK    (0x20U)
#define LPE_EDMA_TCD_TCD2_CSR_MAJORELINK_SHIFT   (5U)
#define LPE_EDMA_TCD_TCD2_CSR_MAJORELINK_WIDTH   (1U)
#define LPE_EDMA_TCD_TCD2_CSR_MAJORELINK(x)      (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD2_CSR_MAJORELINK_SHIFT)) & LPE_EDMA_TCD_TCD2_CSR_MAJORELINK_MASK)

#define LPE_EDMA_TCD_TCD2_CSR_ESDA_MASK          (0x80U)
#define LPE_EDMA_TCD_TCD2_CSR_ESDA_SHIFT         (7U)
#define LPE_EDMA_TCD_TCD2_CSR_ESDA_WIDTH         (1U)
#define LPE_EDMA_TCD_TCD2_CSR_ESDA(x)            (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD2_CSR_ESDA_SHIFT)) & LPE_EDMA_TCD_TCD2_CSR_ESDA_MASK)

#define LPE_EDMA_TCD_TCD2_CSR_MAJORLINKCH_MASK   (0xF00U)
#define LPE_EDMA_TCD_TCD2_CSR_MAJORLINKCH_SHIFT  (8U)
#define LPE_EDMA_TCD_TCD2_CSR_MAJORLINKCH_WIDTH  (4U)
#define LPE_EDMA_TCD_TCD2_CSR_MAJORLINKCH(x)     (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD2_CSR_MAJORLINKCH_SHIFT)) & LPE_EDMA_TCD_TCD2_CSR_MAJORLINKCH_MASK)

#define LPE_EDMA_TCD_TCD2_CSR_BWC_MASK           (0xC000U)
#define LPE_EDMA_TCD_TCD2_CSR_BWC_SHIFT          (14U)
#define LPE_EDMA_TCD_TCD2_CSR_BWC_WIDTH          (2U)
#define LPE_EDMA_TCD_TCD2_CSR_BWC(x)             (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD2_CSR_BWC_SHIFT)) & LPE_EDMA_TCD_TCD2_CSR_BWC_MASK)
/*! @} */

/*! @name TCD2_BITER_ELINKNO - TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define LPE_EDMA_TCD_TCD2_BITER_ELINKNO_BITER_MASK (0x7FFFU)
#define LPE_EDMA_TCD_TCD2_BITER_ELINKNO_BITER_SHIFT (0U)
#define LPE_EDMA_TCD_TCD2_BITER_ELINKNO_BITER_WIDTH (15U)
#define LPE_EDMA_TCD_TCD2_BITER_ELINKNO_BITER(x) (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD2_BITER_ELINKNO_BITER_SHIFT)) & LPE_EDMA_TCD_TCD2_BITER_ELINKNO_BITER_MASK)

#define LPE_EDMA_TCD_TCD2_BITER_ELINKNO_ELINK_MASK (0x8000U)
#define LPE_EDMA_TCD_TCD2_BITER_ELINKNO_ELINK_SHIFT (15U)
#define LPE_EDMA_TCD_TCD2_BITER_ELINKNO_ELINK_WIDTH (1U)
#define LPE_EDMA_TCD_TCD2_BITER_ELINKNO_ELINK(x) (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD2_BITER_ELINKNO_ELINK_SHIFT)) & LPE_EDMA_TCD_TCD2_BITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD2_BITER_ELINKYES - TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define LPE_EDMA_TCD_TCD2_BITER_ELINKYES_BITER_MASK (0x1FFU)
#define LPE_EDMA_TCD_TCD2_BITER_ELINKYES_BITER_SHIFT (0U)
#define LPE_EDMA_TCD_TCD2_BITER_ELINKYES_BITER_WIDTH (9U)
#define LPE_EDMA_TCD_TCD2_BITER_ELINKYES_BITER(x) (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD2_BITER_ELINKYES_BITER_SHIFT)) & LPE_EDMA_TCD_TCD2_BITER_ELINKYES_BITER_MASK)

#define LPE_EDMA_TCD_TCD2_BITER_ELINKYES_LINKCH_MASK (0x1E00U)
#define LPE_EDMA_TCD_TCD2_BITER_ELINKYES_LINKCH_SHIFT (9U)
#define LPE_EDMA_TCD_TCD2_BITER_ELINKYES_LINKCH_WIDTH (4U)
#define LPE_EDMA_TCD_TCD2_BITER_ELINKYES_LINKCH(x) (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD2_BITER_ELINKYES_LINKCH_SHIFT)) & LPE_EDMA_TCD_TCD2_BITER_ELINKYES_LINKCH_MASK)

#define LPE_EDMA_TCD_TCD2_BITER_ELINKYES_ELINK_MASK (0x8000U)
#define LPE_EDMA_TCD_TCD2_BITER_ELINKYES_ELINK_SHIFT (15U)
#define LPE_EDMA_TCD_TCD2_BITER_ELINKYES_ELINK_WIDTH (1U)
#define LPE_EDMA_TCD_TCD2_BITER_ELINKYES_ELINK(x) (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD2_BITER_ELINKYES_ELINK_SHIFT)) & LPE_EDMA_TCD_TCD2_BITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name CH3_CSR - Channel Control and Status */
/*! @{ */

#define LPE_EDMA_TCD_CH3_CSR_ERQ_MASK            (0x1U)
#define LPE_EDMA_TCD_CH3_CSR_ERQ_SHIFT           (0U)
#define LPE_EDMA_TCD_CH3_CSR_ERQ_WIDTH           (1U)
#define LPE_EDMA_TCD_CH3_CSR_ERQ(x)              (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH3_CSR_ERQ_SHIFT)) & LPE_EDMA_TCD_CH3_CSR_ERQ_MASK)

#define LPE_EDMA_TCD_CH3_CSR_EARQ_MASK           (0x2U)
#define LPE_EDMA_TCD_CH3_CSR_EARQ_SHIFT          (1U)
#define LPE_EDMA_TCD_CH3_CSR_EARQ_WIDTH          (1U)
#define LPE_EDMA_TCD_CH3_CSR_EARQ(x)             (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH3_CSR_EARQ_SHIFT)) & LPE_EDMA_TCD_CH3_CSR_EARQ_MASK)

#define LPE_EDMA_TCD_CH3_CSR_EEI_MASK            (0x4U)
#define LPE_EDMA_TCD_CH3_CSR_EEI_SHIFT           (2U)
#define LPE_EDMA_TCD_CH3_CSR_EEI_WIDTH           (1U)
#define LPE_EDMA_TCD_CH3_CSR_EEI(x)              (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH3_CSR_EEI_SHIFT)) & LPE_EDMA_TCD_CH3_CSR_EEI_MASK)

#define LPE_EDMA_TCD_CH3_CSR_EBW_MASK            (0x8U)
#define LPE_EDMA_TCD_CH3_CSR_EBW_SHIFT           (3U)
#define LPE_EDMA_TCD_CH3_CSR_EBW_WIDTH           (1U)
#define LPE_EDMA_TCD_CH3_CSR_EBW(x)              (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH3_CSR_EBW_SHIFT)) & LPE_EDMA_TCD_CH3_CSR_EBW_MASK)

#define LPE_EDMA_TCD_CH3_CSR_DONE_MASK           (0x40000000U)
#define LPE_EDMA_TCD_CH3_CSR_DONE_SHIFT          (30U)
#define LPE_EDMA_TCD_CH3_CSR_DONE_WIDTH          (1U)
#define LPE_EDMA_TCD_CH3_CSR_DONE(x)             (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH3_CSR_DONE_SHIFT)) & LPE_EDMA_TCD_CH3_CSR_DONE_MASK)

