zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_EDMA_TCD.h
#define LPE_EDMA_TCD_CH4_ES_SBE_MASK             (0x2U)
#define LPE_EDMA_TCD_CH4_ES_SBE_SHIFT            (1U)
#define LPE_EDMA_TCD_CH4_ES_SBE_WIDTH            (1U)
#define LPE_EDMA_TCD_CH4_ES_SBE(x)               (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH4_ES_SBE_SHIFT)) & LPE_EDMA_TCD_CH4_ES_SBE_MASK)

#define LPE_EDMA_TCD_CH4_ES_SGE_MASK             (0x4U)
#define LPE_EDMA_TCD_CH4_ES_SGE_SHIFT            (2U)
#define LPE_EDMA_TCD_CH4_ES_SGE_WIDTH            (1U)
#define LPE_EDMA_TCD_CH4_ES_SGE(x)               (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH4_ES_SGE_SHIFT)) & LPE_EDMA_TCD_CH4_ES_SGE_MASK)

#define LPE_EDMA_TCD_CH4_ES_NCE_MASK             (0x8U)
#define LPE_EDMA_TCD_CH4_ES_NCE_SHIFT            (3U)
#define LPE_EDMA_TCD_CH4_ES_NCE_WIDTH            (1U)
#define LPE_EDMA_TCD_CH4_ES_NCE(x)               (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH4_ES_NCE_SHIFT)) & LPE_EDMA_TCD_CH4_ES_NCE_MASK)

#define LPE_EDMA_TCD_CH4_ES_DOE_MASK             (0x10U)
#define LPE_EDMA_TCD_CH4_ES_DOE_SHIFT            (4U)
#define LPE_EDMA_TCD_CH4_ES_DOE_WIDTH            (1U)
#define LPE_EDMA_TCD_CH4_ES_DOE(x)               (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH4_ES_DOE_SHIFT)) & LPE_EDMA_TCD_CH4_ES_DOE_MASK)

#define LPE_EDMA_TCD_CH4_ES_DAE_MASK             (0x20U)
#define LPE_EDMA_TCD_CH4_ES_DAE_SHIFT            (5U)
#define LPE_EDMA_TCD_CH4_ES_DAE_WIDTH            (1U)
#define LPE_EDMA_TCD_CH4_ES_DAE(x)               (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH4_ES_DAE_SHIFT)) & LPE_EDMA_TCD_CH4_ES_DAE_MASK)

#define LPE_EDMA_TCD_CH4_ES_SOE_MASK             (0x40U)
#define LPE_EDMA_TCD_CH4_ES_SOE_SHIFT            (6U)
#define LPE_EDMA_TCD_CH4_ES_SOE_WIDTH            (1U)
#define LPE_EDMA_TCD_CH4_ES_SOE(x)               (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH4_ES_SOE_SHIFT)) & LPE_EDMA_TCD_CH4_ES_SOE_MASK)

#define LPE_EDMA_TCD_CH4_ES_SAE_MASK             (0x80U)
#define LPE_EDMA_TCD_CH4_ES_SAE_SHIFT            (7U)
#define LPE_EDMA_TCD_CH4_ES_SAE_WIDTH            (1U)
#define LPE_EDMA_TCD_CH4_ES_SAE(x)               (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH4_ES_SAE_SHIFT)) & LPE_EDMA_TCD_CH4_ES_SAE_MASK)

#define LPE_EDMA_TCD_CH4_ES_ERR_MASK             (0x80000000U)
#define LPE_EDMA_TCD_CH4_ES_ERR_SHIFT            (31U)
#define LPE_EDMA_TCD_CH4_ES_ERR_WIDTH            (1U)
#define LPE_EDMA_TCD_CH4_ES_ERR(x)               (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH4_ES_ERR_SHIFT)) & LPE_EDMA_TCD_CH4_ES_ERR_MASK)
/*! @} */

/*! @name CH4_INT - Channel Interrupt Status */
/*! @{ */

#define LPE_EDMA_TCD_CH4_INT_INT_MASK            (0x1U)
#define LPE_EDMA_TCD_CH4_INT_INT_SHIFT           (0U)
#define LPE_EDMA_TCD_CH4_INT_INT_WIDTH           (1U)
#define LPE_EDMA_TCD_CH4_INT_INT(x)              (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH4_INT_INT_SHIFT)) & LPE_EDMA_TCD_CH4_INT_INT_MASK)
/*! @} */

/*! @name CH4_SBR - Channel System Bus */
/*! @{ */

#define LPE_EDMA_TCD_CH4_SBR_MID_MASK            (0x3FU)
#define LPE_EDMA_TCD_CH4_SBR_MID_SHIFT           (0U)
#define LPE_EDMA_TCD_CH4_SBR_MID_WIDTH           (6U)
#define LPE_EDMA_TCD_CH4_SBR_MID(x)              (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH4_SBR_MID_SHIFT)) & LPE_EDMA_TCD_CH4_SBR_MID_MASK)

#define LPE_EDMA_TCD_CH4_SBR_PAL_MASK            (0x8000U)
#define LPE_EDMA_TCD_CH4_SBR_PAL_SHIFT           (15U)
#define LPE_EDMA_TCD_CH4_SBR_PAL_WIDTH           (1U)
#define LPE_EDMA_TCD_CH4_SBR_PAL(x)              (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH4_SBR_PAL_SHIFT)) & LPE_EDMA_TCD_CH4_SBR_PAL_MASK)

#define LPE_EDMA_TCD_CH4_SBR_EMI_MASK            (0x10000U)
#define LPE_EDMA_TCD_CH4_SBR_EMI_SHIFT           (16U)
#define LPE_EDMA_TCD_CH4_SBR_EMI_WIDTH           (1U)
#define LPE_EDMA_TCD_CH4_SBR_EMI(x)              (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH4_SBR_EMI_SHIFT)) & LPE_EDMA_TCD_CH4_SBR_EMI_MASK)

#define LPE_EDMA_TCD_CH4_SBR_ATTR_MASK           (0x20000U)
#define LPE_EDMA_TCD_CH4_SBR_ATTR_SHIFT          (17U)
#define LPE_EDMA_TCD_CH4_SBR_ATTR_WIDTH          (1U)
#define LPE_EDMA_TCD_CH4_SBR_ATTR(x)             (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH4_SBR_ATTR_SHIFT)) & LPE_EDMA_TCD_CH4_SBR_ATTR_MASK)
/*! @} */

/*! @name CH4_PRI - Channel Priority */
/*! @{ */

#define LPE_EDMA_TCD_CH4_PRI_APL_MASK            (0x7U)
#define LPE_EDMA_TCD_CH4_PRI_APL_SHIFT           (0U)
#define LPE_EDMA_TCD_CH4_PRI_APL_WIDTH           (3U)
#define LPE_EDMA_TCD_CH4_PRI_APL(x)              (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH4_PRI_APL_SHIFT)) & LPE_EDMA_TCD_CH4_PRI_APL_MASK)

#define LPE_EDMA_TCD_CH4_PRI_DPA_MASK            (0x40000000U)
#define LPE_EDMA_TCD_CH4_PRI_DPA_SHIFT           (30U)
#define LPE_EDMA_TCD_CH4_PRI_DPA_WIDTH           (1U)
#define LPE_EDMA_TCD_CH4_PRI_DPA(x)              (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH4_PRI_DPA_SHIFT)) & LPE_EDMA_TCD_CH4_PRI_DPA_MASK)

#define LPE_EDMA_TCD_CH4_PRI_ECP_MASK            (0x80000000U)
#define LPE_EDMA_TCD_CH4_PRI_ECP_SHIFT           (31U)
#define LPE_EDMA_TCD_CH4_PRI_ECP_WIDTH           (1U)
#define LPE_EDMA_TCD_CH4_PRI_ECP(x)              (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH4_PRI_ECP_SHIFT)) & LPE_EDMA_TCD_CH4_PRI_ECP_MASK)
/*! @} */

/*! @name TCD4_SADDR - TCD Source Address */
/*! @{ */

#define LPE_EDMA_TCD_TCD4_SADDR_SADDR_MASK       (0xFFFFFFFFU)
#define LPE_EDMA_TCD_TCD4_SADDR_SADDR_SHIFT      (0U)
#define LPE_EDMA_TCD_TCD4_SADDR_SADDR_WIDTH      (32U)
#define LPE_EDMA_TCD_TCD4_SADDR_SADDR(x)         (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD4_SADDR_SADDR_SHIFT)) & LPE_EDMA_TCD_TCD4_SADDR_SADDR_MASK)
/*! @} */

/*! @name TCD4_SOFF - TCD Signed Source Address Offset */
/*! @{ */

#define LPE_EDMA_TCD_TCD4_SOFF_SOFF_MASK         (0xFFFFU)
#define LPE_EDMA_TCD_TCD4_SOFF_SOFF_SHIFT        (0U)
#define LPE_EDMA_TCD_TCD4_SOFF_SOFF_WIDTH        (16U)
#define LPE_EDMA_TCD_TCD4_SOFF_SOFF(x)           (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD4_SOFF_SOFF_SHIFT)) & LPE_EDMA_TCD_TCD4_SOFF_SOFF_MASK)
/*! @} */

/*! @name TCD4_ATTR - TCD Transfer Attributes */
/*! @{ */

#define LPE_EDMA_TCD_TCD4_ATTR_DSIZE_MASK        (0x7U)
#define LPE_EDMA_TCD_TCD4_ATTR_DSIZE_SHIFT       (0U)
#define LPE_EDMA_TCD_TCD4_ATTR_DSIZE_WIDTH       (3U)
#define LPE_EDMA_TCD_TCD4_ATTR_DSIZE(x)          (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD4_ATTR_DSIZE_SHIFT)) & LPE_EDMA_TCD_TCD4_ATTR_DSIZE_MASK)

#define LPE_EDMA_TCD_TCD4_ATTR_DMOD_MASK         (0xF8U)
#define LPE_EDMA_TCD_TCD4_ATTR_DMOD_SHIFT        (3U)
#define LPE_EDMA_TCD_TCD4_ATTR_DMOD_WIDTH        (5U)
#define LPE_EDMA_TCD_TCD4_ATTR_DMOD(x)           (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD4_ATTR_DMOD_SHIFT)) & LPE_EDMA_TCD_TCD4_ATTR_DMOD_MASK)

