zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_EDMA_TCD.h
#define LPE_EDMA_TCD_CH8_PRI_DPA_MASK            (0x40000000U)
#define LPE_EDMA_TCD_CH8_PRI_DPA_SHIFT           (30U)
#define LPE_EDMA_TCD_CH8_PRI_DPA_WIDTH           (1U)
#define LPE_EDMA_TCD_CH8_PRI_DPA(x)              (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH8_PRI_DPA_SHIFT)) & LPE_EDMA_TCD_CH8_PRI_DPA_MASK)

#define LPE_EDMA_TCD_CH8_PRI_ECP_MASK            (0x80000000U)
#define LPE_EDMA_TCD_CH8_PRI_ECP_SHIFT           (31U)
#define LPE_EDMA_TCD_CH8_PRI_ECP_WIDTH           (1U)
#define LPE_EDMA_TCD_CH8_PRI_ECP(x)              (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH8_PRI_ECP_SHIFT)) & LPE_EDMA_TCD_CH8_PRI_ECP_MASK)
/*! @} */

/*! @name TCD8_SADDR - TCD Source Address */
/*! @{ */

#define LPE_EDMA_TCD_TCD8_SADDR_SADDR_MASK       (0xFFFFFFFFU)
#define LPE_EDMA_TCD_TCD8_SADDR_SADDR_SHIFT      (0U)
#define LPE_EDMA_TCD_TCD8_SADDR_SADDR_WIDTH      (32U)
#define LPE_EDMA_TCD_TCD8_SADDR_SADDR(x)         (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD8_SADDR_SADDR_SHIFT)) & LPE_EDMA_TCD_TCD8_SADDR_SADDR_MASK)
/*! @} */

/*! @name TCD8_SOFF - TCD Signed Source Address Offset */
/*! @{ */

#define LPE_EDMA_TCD_TCD8_SOFF_SOFF_MASK         (0xFFFFU)
#define LPE_EDMA_TCD_TCD8_SOFF_SOFF_SHIFT        (0U)
#define LPE_EDMA_TCD_TCD8_SOFF_SOFF_WIDTH        (16U)
#define LPE_EDMA_TCD_TCD8_SOFF_SOFF(x)           (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD8_SOFF_SOFF_SHIFT)) & LPE_EDMA_TCD_TCD8_SOFF_SOFF_MASK)
/*! @} */

/*! @name TCD8_ATTR - TCD Transfer Attributes */
/*! @{ */

#define LPE_EDMA_TCD_TCD8_ATTR_DSIZE_MASK        (0x7U)
#define LPE_EDMA_TCD_TCD8_ATTR_DSIZE_SHIFT       (0U)
#define LPE_EDMA_TCD_TCD8_ATTR_DSIZE_WIDTH       (3U)
#define LPE_EDMA_TCD_TCD8_ATTR_DSIZE(x)          (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD8_ATTR_DSIZE_SHIFT)) & LPE_EDMA_TCD_TCD8_ATTR_DSIZE_MASK)

#define LPE_EDMA_TCD_TCD8_ATTR_DMOD_MASK         (0xF8U)
#define LPE_EDMA_TCD_TCD8_ATTR_DMOD_SHIFT        (3U)
#define LPE_EDMA_TCD_TCD8_ATTR_DMOD_WIDTH        (5U)
#define LPE_EDMA_TCD_TCD8_ATTR_DMOD(x)           (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD8_ATTR_DMOD_SHIFT)) & LPE_EDMA_TCD_TCD8_ATTR_DMOD_MASK)

#define LPE_EDMA_TCD_TCD8_ATTR_SSIZE_MASK        (0x700U)
#define LPE_EDMA_TCD_TCD8_ATTR_SSIZE_SHIFT       (8U)
#define LPE_EDMA_TCD_TCD8_ATTR_SSIZE_WIDTH       (3U)
#define LPE_EDMA_TCD_TCD8_ATTR_SSIZE(x)          (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD8_ATTR_SSIZE_SHIFT)) & LPE_EDMA_TCD_TCD8_ATTR_SSIZE_MASK)

#define LPE_EDMA_TCD_TCD8_ATTR_SMOD_MASK         (0xF800U)
#define LPE_EDMA_TCD_TCD8_ATTR_SMOD_SHIFT        (11U)
#define LPE_EDMA_TCD_TCD8_ATTR_SMOD_WIDTH        (5U)
#define LPE_EDMA_TCD_TCD8_ATTR_SMOD(x)           (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD8_ATTR_SMOD_SHIFT)) & LPE_EDMA_TCD_TCD8_ATTR_SMOD_MASK)
/*! @} */

/*! @name TCD8_NBYTES_MLOFFNO - TCD Transfer Size Without Minor Loop Offsets */
/*! @{ */

#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFNO_NBYTES_MASK (0x3FFFFFFFU)
#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFNO_NBYTES_SHIFT (0U)
#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFNO_NBYTES_WIDTH (30U)
#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFNO_NBYTES(x) (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD8_NBYTES_MLOFFNO_NBYTES_SHIFT)) & LPE_EDMA_TCD_TCD8_NBYTES_MLOFFNO_NBYTES_MASK)

#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFNO_DMLOE_MASK (0x40000000U)
#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFNO_DMLOE_SHIFT (30U)
#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFNO_DMLOE_WIDTH (1U)
#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFNO_DMLOE(x) (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD8_NBYTES_MLOFFNO_DMLOE_SHIFT)) & LPE_EDMA_TCD_TCD8_NBYTES_MLOFFNO_DMLOE_MASK)

#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFNO_SMLOE_MASK (0x80000000U)
#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFNO_SMLOE_SHIFT (31U)
#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFNO_SMLOE_WIDTH (1U)
#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFNO_SMLOE(x) (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD8_NBYTES_MLOFFNO_SMLOE_SHIFT)) & LPE_EDMA_TCD_TCD8_NBYTES_MLOFFNO_SMLOE_MASK)
/*! @} */

/*! @name TCD8_NBYTES_MLOFFYES - TCD Transfer Size with Minor Loop Offsets */
/*! @{ */

#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_NBYTES_MASK (0x3FFU)
#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_NBYTES_SHIFT (0U)
#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_NBYTES_WIDTH (10U)
#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_NBYTES(x) (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_NBYTES_SHIFT)) & LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_NBYTES_MASK)

#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_MLOFF_MASK (0x3FFFFC00U)
#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_MLOFF_SHIFT (10U)
#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_MLOFF_WIDTH (20U)
#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_MLOFF(x) (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_MLOFF_SHIFT)) & LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_MLOFF_MASK)

#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_DMLOE_MASK (0x40000000U)
#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_DMLOE_SHIFT (30U)
#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_DMLOE_WIDTH (1U)
#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_DMLOE(x) (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_DMLOE_SHIFT)) & LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_DMLOE_MASK)

#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_SMLOE_MASK (0x80000000U)
#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_SMLOE_SHIFT (31U)
#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_SMLOE_WIDTH (1U)
#define LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_SMLOE(x) (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_SMLOE_SHIFT)) & LPE_EDMA_TCD_TCD8_NBYTES_MLOFFYES_SMLOE_MASK)
/*! @} */

/*! @name TCD8_SLAST_SDA - TCD Last Source Address Adjustment / Store DADDR Address */
/*! @{ */

#define LPE_EDMA_TCD_TCD8_SLAST_SDA_SLAST_SDA_MASK (0xFFFFFFFFU)
#define LPE_EDMA_TCD_TCD8_SLAST_SDA_SLAST_SDA_SHIFT (0U)
#define LPE_EDMA_TCD_TCD8_SLAST_SDA_SLAST_SDA_WIDTH (32U)
#define LPE_EDMA_TCD_TCD8_SLAST_SDA_SLAST_SDA(x) (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD8_SLAST_SDA_SLAST_SDA_SHIFT)) & LPE_EDMA_TCD_TCD8_SLAST_SDA_SLAST_SDA_MASK)
/*! @} */

/*! @name TCD8_DADDR - TCD Destination Address */
/*! @{ */

