zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_EDMA_TCD.h
#define LPE_EDMA_TCD_CH11_INT_INT_MASK           (0x1U)
#define LPE_EDMA_TCD_CH11_INT_INT_SHIFT          (0U)
#define LPE_EDMA_TCD_CH11_INT_INT_WIDTH          (1U)
#define LPE_EDMA_TCD_CH11_INT_INT(x)             (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH11_INT_INT_SHIFT)) & LPE_EDMA_TCD_CH11_INT_INT_MASK)
/*! @} */

/*! @name CH11_SBR - Channel System Bus */
/*! @{ */

#define LPE_EDMA_TCD_CH11_SBR_MID_MASK           (0x3FU)
#define LPE_EDMA_TCD_CH11_SBR_MID_SHIFT          (0U)
#define LPE_EDMA_TCD_CH11_SBR_MID_WIDTH          (6U)
#define LPE_EDMA_TCD_CH11_SBR_MID(x)             (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH11_SBR_MID_SHIFT)) & LPE_EDMA_TCD_CH11_SBR_MID_MASK)

#define LPE_EDMA_TCD_CH11_SBR_PAL_MASK           (0x8000U)
#define LPE_EDMA_TCD_CH11_SBR_PAL_SHIFT          (15U)
#define LPE_EDMA_TCD_CH11_SBR_PAL_WIDTH          (1U)
#define LPE_EDMA_TCD_CH11_SBR_PAL(x)             (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH11_SBR_PAL_SHIFT)) & LPE_EDMA_TCD_CH11_SBR_PAL_MASK)

#define LPE_EDMA_TCD_CH11_SBR_EMI_MASK           (0x10000U)
#define LPE_EDMA_TCD_CH11_SBR_EMI_SHIFT          (16U)
#define LPE_EDMA_TCD_CH11_SBR_EMI_WIDTH          (1U)
#define LPE_EDMA_TCD_CH11_SBR_EMI(x)             (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH11_SBR_EMI_SHIFT)) & LPE_EDMA_TCD_CH11_SBR_EMI_MASK)

#define LPE_EDMA_TCD_CH11_SBR_ATTR_MASK          (0x20000U)
#define LPE_EDMA_TCD_CH11_SBR_ATTR_SHIFT         (17U)
#define LPE_EDMA_TCD_CH11_SBR_ATTR_WIDTH         (1U)
#define LPE_EDMA_TCD_CH11_SBR_ATTR(x)            (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH11_SBR_ATTR_SHIFT)) & LPE_EDMA_TCD_CH11_SBR_ATTR_MASK)
/*! @} */

/*! @name CH11_PRI - Channel Priority */
/*! @{ */

#define LPE_EDMA_TCD_CH11_PRI_APL_MASK           (0x7U)
#define LPE_EDMA_TCD_CH11_PRI_APL_SHIFT          (0U)
#define LPE_EDMA_TCD_CH11_PRI_APL_WIDTH          (3U)
#define LPE_EDMA_TCD_CH11_PRI_APL(x)             (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH11_PRI_APL_SHIFT)) & LPE_EDMA_TCD_CH11_PRI_APL_MASK)

#define LPE_EDMA_TCD_CH11_PRI_DPA_MASK           (0x40000000U)
#define LPE_EDMA_TCD_CH11_PRI_DPA_SHIFT          (30U)
#define LPE_EDMA_TCD_CH11_PRI_DPA_WIDTH          (1U)
#define LPE_EDMA_TCD_CH11_PRI_DPA(x)             (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH11_PRI_DPA_SHIFT)) & LPE_EDMA_TCD_CH11_PRI_DPA_MASK)

#define LPE_EDMA_TCD_CH11_PRI_ECP_MASK           (0x80000000U)
#define LPE_EDMA_TCD_CH11_PRI_ECP_SHIFT          (31U)
#define LPE_EDMA_TCD_CH11_PRI_ECP_WIDTH          (1U)
#define LPE_EDMA_TCD_CH11_PRI_ECP(x)             (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_CH11_PRI_ECP_SHIFT)) & LPE_EDMA_TCD_CH11_PRI_ECP_MASK)
/*! @} */

/*! @name TCD11_SADDR - TCD Source Address */
/*! @{ */

#define LPE_EDMA_TCD_TCD11_SADDR_SADDR_MASK      (0xFFFFFFFFU)
#define LPE_EDMA_TCD_TCD11_SADDR_SADDR_SHIFT     (0U)
#define LPE_EDMA_TCD_TCD11_SADDR_SADDR_WIDTH     (32U)
#define LPE_EDMA_TCD_TCD11_SADDR_SADDR(x)        (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD11_SADDR_SADDR_SHIFT)) & LPE_EDMA_TCD_TCD11_SADDR_SADDR_MASK)
/*! @} */

/*! @name TCD11_SOFF - TCD Signed Source Address Offset */
/*! @{ */

#define LPE_EDMA_TCD_TCD11_SOFF_SOFF_MASK        (0xFFFFU)
#define LPE_EDMA_TCD_TCD11_SOFF_SOFF_SHIFT       (0U)
#define LPE_EDMA_TCD_TCD11_SOFF_SOFF_WIDTH       (16U)
#define LPE_EDMA_TCD_TCD11_SOFF_SOFF(x)          (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD11_SOFF_SOFF_SHIFT)) & LPE_EDMA_TCD_TCD11_SOFF_SOFF_MASK)
/*! @} */

/*! @name TCD11_ATTR - TCD Transfer Attributes */
/*! @{ */

#define LPE_EDMA_TCD_TCD11_ATTR_DSIZE_MASK       (0x7U)
#define LPE_EDMA_TCD_TCD11_ATTR_DSIZE_SHIFT      (0U)
#define LPE_EDMA_TCD_TCD11_ATTR_DSIZE_WIDTH      (3U)
#define LPE_EDMA_TCD_TCD11_ATTR_DSIZE(x)         (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD11_ATTR_DSIZE_SHIFT)) & LPE_EDMA_TCD_TCD11_ATTR_DSIZE_MASK)

#define LPE_EDMA_TCD_TCD11_ATTR_DMOD_MASK        (0xF8U)
#define LPE_EDMA_TCD_TCD11_ATTR_DMOD_SHIFT       (3U)
#define LPE_EDMA_TCD_TCD11_ATTR_DMOD_WIDTH       (5U)
#define LPE_EDMA_TCD_TCD11_ATTR_DMOD(x)          (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD11_ATTR_DMOD_SHIFT)) & LPE_EDMA_TCD_TCD11_ATTR_DMOD_MASK)

#define LPE_EDMA_TCD_TCD11_ATTR_SSIZE_MASK       (0x700U)
#define LPE_EDMA_TCD_TCD11_ATTR_SSIZE_SHIFT      (8U)
#define LPE_EDMA_TCD_TCD11_ATTR_SSIZE_WIDTH      (3U)
#define LPE_EDMA_TCD_TCD11_ATTR_SSIZE(x)         (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD11_ATTR_SSIZE_SHIFT)) & LPE_EDMA_TCD_TCD11_ATTR_SSIZE_MASK)

#define LPE_EDMA_TCD_TCD11_ATTR_SMOD_MASK        (0xF800U)
#define LPE_EDMA_TCD_TCD11_ATTR_SMOD_SHIFT       (11U)
#define LPE_EDMA_TCD_TCD11_ATTR_SMOD_WIDTH       (5U)
#define LPE_EDMA_TCD_TCD11_ATTR_SMOD(x)          (((uint16_t)(((uint16_t)(x)) << LPE_EDMA_TCD_TCD11_ATTR_SMOD_SHIFT)) & LPE_EDMA_TCD_TCD11_ATTR_SMOD_MASK)
/*! @} */

/*! @name TCD11_NBYTES_MLOFFNO - TCD Transfer Size Without Minor Loop Offsets */
/*! @{ */

#define LPE_EDMA_TCD_TCD11_NBYTES_MLOFFNO_NBYTES_MASK (0x3FFFFFFFU)
#define LPE_EDMA_TCD_TCD11_NBYTES_MLOFFNO_NBYTES_SHIFT (0U)
#define LPE_EDMA_TCD_TCD11_NBYTES_MLOFFNO_NBYTES_WIDTH (30U)
#define LPE_EDMA_TCD_TCD11_NBYTES_MLOFFNO_NBYTES(x) (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD11_NBYTES_MLOFFNO_NBYTES_SHIFT)) & LPE_EDMA_TCD_TCD11_NBYTES_MLOFFNO_NBYTES_MASK)

#define LPE_EDMA_TCD_TCD11_NBYTES_MLOFFNO_DMLOE_MASK (0x40000000U)
#define LPE_EDMA_TCD_TCD11_NBYTES_MLOFFNO_DMLOE_SHIFT (30U)
#define LPE_EDMA_TCD_TCD11_NBYTES_MLOFFNO_DMLOE_WIDTH (1U)
#define LPE_EDMA_TCD_TCD11_NBYTES_MLOFFNO_DMLOE(x) (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD11_NBYTES_MLOFFNO_DMLOE_SHIFT)) & LPE_EDMA_TCD_TCD11_NBYTES_MLOFFNO_DMLOE_MASK)

#define LPE_EDMA_TCD_TCD11_NBYTES_MLOFFNO_SMLOE_MASK (0x80000000U)
#define LPE_EDMA_TCD_TCD11_NBYTES_MLOFFNO_SMLOE_SHIFT (31U)
#define LPE_EDMA_TCD_TCD11_NBYTES_MLOFFNO_SMLOE_WIDTH (1U)
#define LPE_EDMA_TCD_TCD11_NBYTES_MLOFFNO_SMLOE(x) (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD11_NBYTES_MLOFFNO_SMLOE_SHIFT)) & LPE_EDMA_TCD_TCD11_NBYTES_MLOFFNO_SMLOE_MASK)
/*! @} */

/*! @name TCD11_NBYTES_MLOFFYES - TCD Transfer Size with Minor Loop Offsets */
/*! @{ */

#define LPE_EDMA_TCD_TCD11_NBYTES_MLOFFYES_NBYTES_MASK (0x3FFU)
#define LPE_EDMA_TCD_TCD11_NBYTES_MLOFFYES_NBYTES_SHIFT (0U)
#define LPE_EDMA_TCD_TCD11_NBYTES_MLOFFYES_NBYTES_WIDTH (10U)
#define LPE_EDMA_TCD_TCD11_NBYTES_MLOFFYES_NBYTES(x) (((uint32_t)(((uint32_t)(x)) << LPE_EDMA_TCD_TCD11_NBYTES_MLOFFYES_NBYTES_SHIFT)) & LPE_EDMA_TCD_TCD11_NBYTES_MLOFFYES_NBYTES_MASK)

